// 1) Даний об'єкт з містами та країнами. Вивести масив значення в якому будуть рядки перетворені на цей формат: <Столиця> - це <Країна>.

// const countries = {
//   Ukraine: "Kyiv",
//   France: "Paris",
//   Germany: "Berlin",
//   Poland: "Warsaw",
//   Italy: "Rome",
// };
// const objEntries = [];

// for (const key in countries) {
//   objEntries.push(`${countries[key]} - is ${[key]}`);
// }
// console.log(objEntries);

// 2) Створити функцію яка виведе багатовимірний масив A. Даний масив містить список інших масивів B. Масиви B повинні містити по 3 значення. Та вивести його максимальне значення

// const arr = [
//   [4, 2, 1],
//   [7, 2, 6],
//   [5, 9, 4],
//   [8, 1, 7],
// ];

// function foreachArr(arr) {
//   arr.forEach(function (item) {
//     console.log(item);
//   });
// }
// foreachArr(arr);

// console.log(
//   "Max value:",
//   Math.max(...arr.reduce((res, cur) => res.concat(cur)))
// );

// 3) Створити об'єкт із назвами днів тижня. Де ключами будуть uk і en, a значенням властивості uk буде масив із назвами днів тижня українською, а en - англійською. Після написати функцію яка буде виводити в консоль назву дня тижня, користуючись вище створеним об'єктом. Усі дні тижня починаються з 1 і закінчуються цифрою 7 (1- понеділок, 7 - неділя). Функція отримує змінну lang – назву мови дня тижня та змінну day – число дня тижня.

// const langs = {
//   Uk: [
//     "Понеділок",
//     "Вівторок",
//     "Середа",
//     "Четвер",
//     "Пятниця",
//     "Субота",
//     "Неділя",
//   ],
//   En: [
//     "Monday",
//     "Tuesday",
//     "Wednesday",
//     "Thursday",
//     "Friday",
//     "Saturday",
//     "Sunday",
//   ],
// };

// function dayWeek(language, day) {
//   //Функция которая определяет день недели
//   return langs[language][day - 1];
// }

// console.log(dayWeek("Uk", 4));

// 4) Створіть функцію, яка повертає суму двох найменших позитивних чисел із масиву мінімум 4 позитивних цілих чисел. Не передаються числа з плаваючою комою або непозитивні цілі числа.

// let array = [15, 4, 8, 21, 11];

// function sumTwo(arr) {
//   return arr
//     .sort((a, b) => a - b)
//     .slice(0, 2)
//     .reduce((a, b) => a + b);
// }
// console.log(sumTwo(array));

// 5) Даний масив одиниць і нулів, перетворіть еквівалентне двійкове значення ціле число.
// Наприклад: [0, 0, 0, 1] розглядається як 0001 двійкове уявлення 1.

// const binary = [1, 0, 1, 0, 1, 1];

// console.log(`Result: ${parseInt(binary.join(""), 2)}`);
